## Plan Result (sbox_landing)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 31 to add, 6 to change, 4 to destroy.</code></pre>

* Create
  * module.data_landing_zone[&#34;00&#34;].module.runtimes_datafactory.azurerm_data_factory_managed_private_endpoint.dependants[&#34;purview-storage-blob&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.runtimes_datafactory.azurerm_data_factory_managed_private_endpoint.dependants[&#34;purview-storage-queue&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.runtimes_datafactory.azurerm_data_factory_managed_private_endpoint.dependants[&#34;purview_eventhub&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.runtimes_datafactory.null_resource.private_endpoint_approvals[&#34;purview&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.runtimes_datafactory.null_resource.private_endpoint_approvals[&#34;purview-storage-blob&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.runtimes_datafactory.null_resource.private_endpoint_approvals[&#34;purview-storage-queue&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.runtimes_datafactory.null_resource.private_endpoint_approvals[&#34;purview_eventhub&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.shared_integration_datafactory.azurerm_data_factory_linked_service_azure_blob_storage.this[&#34;ingest00curatedsbox&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.shared_integration_datafactory.azurerm_data_factory_linked_service_azure_blob_storage.this[&#34;ingest00rawsbox&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.shared_integration_datafactory.azurerm_data_factory_linked_service_azure_databricks.this[&#34;ingest00-integration-databricks001-sbox&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.shared_integration_datafactory.azurerm_data_factory_linked_service_azure_sql_database.this[&#34;ingest00-metadata-db-sbox&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.shared_integration_datafactory.azurerm_data_factory_linked_service_key_vault.this[&#34;ingest00-meta001-sbox&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.shared_integration_datafactory.azurerm_data_factory_linked_service_sql_server.this[&#34;ingest00-metadata-mssql-sbox&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.shared_integration_datafactory.azurerm_data_factory_managed_private_endpoint.dependants[&#34;purview-storage-blob&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.shared_integration_datafactory.azurerm_data_factory_managed_private_endpoint.dependants[&#34;purview-storage-queue&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.shared_integration_datafactory.azurerm_data_factory_managed_private_endpoint.dependants[&#34;purview_eventhub&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.shared_integration_datafactory.azurerm_data_factory_managed_private_endpoint.this[&#34;purview&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.shared_integration_datafactory.azurerm_data_factory_managed_private_endpoint.this[&#34;storage-curated&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.shared_integration_datafactory.azurerm_data_factory_managed_private_endpoint.this[&#34;storage-raw&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.shared_integration_datafactory.null_resource.private_endpoint_approvals[&#34;keyvault&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.shared_integration_datafactory.null_resource.private_endpoint_approvals[&#34;mssql&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.shared_integration_datafactory.null_resource.private_endpoint_approvals[&#34;purview&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.shared_integration_datafactory.null_resource.private_endpoint_approvals[&#34;purview-storage-blob&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.shared_integration_datafactory.null_resource.private_endpoint_approvals[&#34;purview-storage-queue&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.shared_integration_datafactory.null_resource.private_endpoint_approvals[&#34;purview_eventhub&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.shared_integration_datafactory.null_resource.private_endpoint_approvals[&#34;storage-curated&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.shared_integration_datafactory.null_resource.private_endpoint_approvals[&#34;storage-raw&#34;]
* Update
  * module.data_landing_zone[&#34;00&#34;].azurerm_synapse_workspace_aad_admin.this
  * module.data_landing_zone[&#34;00&#34;].module.metadata_mssql.azurerm_mssql_database.this[&#34;ingest00-metadata-db-sbox&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.networking.azurerm_subnet.this[&#34;vnet-data-bricks-private&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.networking.azurerm_subnet.this[&#34;vnet-data-bricks-product-private&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.networking.azurerm_subnet.this[&#34;vnet-data-bricks-product-public&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.networking.azurerm_subnet.this[&#34;vnet-data-bricks-public&#34;]
* Replace
  * module.data_landing_zone[&#34;00&#34;].azurerm_synapse_workspace.this
  * module.data_landing_zone[&#34;00&#34;].module.synapse_pe[&#34;dev&#34;].azurerm_private_endpoint.this
  * module.data_landing_zone[&#34;00&#34;].module.synapse_pe[&#34;sql&#34;].azurerm_private_endpoint.this
  * module.data_landing_zone[&#34;00&#34;].module.synapse_pe[&#34;sqlOnDemand&#34;].azurerm_private_endpoint.this




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.data_landing_zone["00"].azurerm_synapse_workspace.this must be replaced
-/+ resource "azurerm_synapse_workspace" "this" {
      ~ aad_admin                            = [
          - {
              - login     = "DTS Platform Operations"
              - object_id = "e7ea2042-4ced-45dd-8ae3-e051c6551789"
              - tenant_id = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
            },
        ] -> (known after apply)
      ~ connectivity_endpoints               = {
          - "dev"         = "https://ingest00-product-synapse001-sbox.dev.azuresynapse.net"
          - "sql"         = "ingest00-product-synapse001-sbox.sql.azuresynapse.net"
          - "sqlOnDemand" = "ingest00-product-synapse001-sbox-ondemand.sql.azuresynapse.net"
          - "web"         = "https://web.azuresynapse.net?workspace=%2fsubscriptions%2fdf72bb30-d6fb-47bd-82ee-5eb87473ddb3%2fresourceGroups%2fingest00-shared-product-sbox%2fproviders%2fMicrosoft.Synapse%2fworkspaces%2fingest00-product-synapse001-sbox"
        } -> (known after apply)
      ~ id                                   = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-shared-product-sbox/providers/Microsoft.Synapse/workspaces/ingest00-product-synapse001-sbox" -> (known after apply)
      ~ managed_resource_group_name          = "synapseworkspace-managedrg-a28bee1a-1a4a-4632-b2f6-a14418d8c07a" -> (known after apply)
      - managed_virtual_network_enabled      = false -> null
        name                                 = "ingest00-product-synapse001-sbox"
      ~ sql_aad_admin                        = [
          - {
              - login     = "DTS Platform Operations"
              - object_id = "e7ea2042-4ced-45dd-8ae3-e051c6551789"
              - tenant_id = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
            },
        ] -> (known after apply)
      - sql_administrator_login              = "sqladminuser" -> null # forces replacement
      - sql_identity_control_enabled         = false -> null
        tags                                 = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (4 unchanged attributes hidden)

      ~ identity {
          - identity_ids = [] -> null
          ~ principal_id = "01b4626b-b101-4631-bae4-bdfd56ea9f84" -> (known after apply)
          ~ tenant_id    = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> (known after apply)
            # (1 unchanged attribute hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.data_landing_zone["00"].azurerm_synapse_workspace_aad_admin.this will be updated in-place
  ~ resource "azurerm_synapse_workspace_aad_admin" "this" {
        id                   = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-shared-product-sbox/providers/Microsoft.Synapse/workspaces/ingest00-product-synapse001-sbox/administrators/activeDirectory"
      ~ synapse_workspace_id = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-shared-product-sbox/providers/Microsoft.Synapse/workspaces/ingest00-product-synapse001-sbox" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.data_landing_zone["00"].module.metadata_mssql.azurerm_mssql_database.this["ingest00-metadata-db-sbox"] will be updated in-place
  ~ resource "azurerm_mssql_database" "this" {
      ~ auto_pause_delay_in_minutes         = 0 -> -1
        id                                  = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-metadata-sbox/providers/Microsoft.Sql/servers/ingest00-metadata-mssql-sbox/databases/ingest00-metadata-db-sbox"
      ~ min_capacity                        = 0 -> 1
        name                                = "ingest00-metadata-db-sbox"
        tags                                = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (14 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.data_landing_zone["00"].module.networking.azurerm_subnet.this["vnet-data-bricks-private"] will be updated in-place
  ~ resource "azurerm_subnet" "this" {
        id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-network-sbox/providers/Microsoft.Network/virtualNetworks/ingest00-vnet-sbox/subnets/ingest00-data-bricks-private-sbox"
        name                                           = "ingest00-data-bricks-private-sbox"
        # (9 unchanged attributes hidden)

      ~ delegation {
            name = "data-bricks-delegation"

          ~ service_delegation {
              ~ actions = [
                  - "Microsoft.Network/virtualNetworks/subnets/join/action",
                  - "Microsoft.Network/virtualNetworks/subnets/prepareNetworkPolicies/action",
                  - "Microsoft.Network/virtualNetworks/subnets/unprepareNetworkPolicies/action",
                ]
                name    = "Microsoft.Databricks/workspaces"
            }
        }
    }

  # module.data_landing_zone["00"].module.networking.azurerm_subnet.this["vnet-data-bricks-product-private"] will be updated in-place
  ~ resource "azurerm_subnet" "this" {
        id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-network-sbox/providers/Microsoft.Network/virtualNetworks/ingest00-vnet-sbox/subnets/ingest00-data-bricks-product-private-sbox"
        name                                           = "ingest00-data-bricks-product-private-sbox"
        # (9 unchanged attributes hidden)

      ~ delegation {
            name = "data-bricks-delegation"

          ~ service_delegation {
              ~ actions = [
                  - "Microsoft.Network/virtualNetworks/subnets/join/action",
                  - "Microsoft.Network/virtualNetworks/subnets/prepareNetworkPolicies/action",
                  - "Microsoft.Network/virtualNetworks/subnets/unprepareNetworkPolicies/action",
                ]
                name    = "Microsoft.Databricks/workspaces"
            }
        }
    }

  # module.data_landing_zone["00"].module.networking.azurerm_subnet.this["vnet-data-bricks-product-public"] will be updated in-place
  ~ resource "azurerm_subnet" "this" {
        id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-network-sbox/providers/Microsoft.Network/virtualNetworks/ingest00-vnet-sbox/subnets/ingest00-data-bricks-product-public-sbox"
        name                                           = "ingest00-data-bricks-product-public-sbox"
        # (9 unchanged attributes hidden)

      ~ delegation {
            name = "data-bricks-delegation"

          ~ service_delegation {
              ~ actions = [
                  - "Microsoft.Network/virtualNetworks/subnets/join/action",
                  - "Microsoft.Network/virtualNetworks/subnets/prepareNetworkPolicies/action",
                  - "Microsoft.Network/virtualNetworks/subnets/unprepareNetworkPolicies/action",
                ]
                name    = "Microsoft.Databricks/workspaces"
            }
        }
    }

  # module.data_landing_zone["00"].module.networking.azurerm_subnet.this["vnet-data-bricks-public"] will be updated in-place
  ~ resource "azurerm_subnet" "this" {
        id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-network-sbox/providers/Microsoft.Network/virtualNetworks/ingest00-vnet-sbox/subnets/ingest00-data-bricks-public-sbox"
        name                                           = "ingest00-data-bricks-public-sbox"
        # (9 unchanged attributes hidden)

      ~ delegation {
            name = "data-bricks-delegation"

          ~ service_delegation {
              ~ actions = [
                  - "Microsoft.Network/virtualNetworks/subnets/join/action",
                  - "Microsoft.Network/virtualNetworks/subnets/prepareNetworkPolicies/action",
                  - "Microsoft.Network/virtualNetworks/subnets/unprepareNetworkPolicies/action",
                ]
                name    = "Microsoft.Databricks/workspaces"
            }
        }
    }

  # module.data_landing_zone["00"].module.runtimes_datafactory.azurerm_data_factory_managed_private_endpoint.dependants["purview-storage-blob"] will be created
  + resource "azurerm_data_factory_managed_private_endpoint" "dependants" {
      + data_factory_id    = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-runtimes-sbox/providers/Microsoft.DataFactory/factories/ingest00-runtimes-dataFactory001-sbox"
      + fqdns              = (known after apply)
      + id                 = (known after apply)
      + name               = "ingest00-runtimes-dataFactory001-purview-storage-blob-sbox"
      + subresource_name   = "blob"
      + target_resource_id = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest-mgmt-purview-sbox/providers/Microsoft.Storage/storageAccounts/scanuksouthojlgpfa"
    }

  # module.data_landing_zone["00"].module.runtimes_datafactory.azurerm_data_factory_managed_private_endpoint.dependants["purview-storage-queue"] will be created
  + resource "azurerm_data_factory_managed_private_endpoint" "dependants" {
      + data_factory_id    = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-runtimes-sbox/providers/Microsoft.DataFactory/factories/ingest00-runtimes-dataFactory001-sbox"
      + fqdns              = (known after apply)
      + id                 = (known after apply)
      + name               = "ingest00-runtimes-dataFactory001-purview-storage-queue-sbox"
      + subresource_name   = "queue"
      + target_resource_id = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest-mgmt-purview-sbox/providers/Microsoft.Storage/storageAccounts/scanuksouthojlgpfa"
    }

  # module.data_landing_zone["00"].module.runtimes_datafactory.azurerm_data_factory_managed_private_endpoint.dependants["purview_eventhub"] will be created
  + resource "azurerm_data_factory_managed_private_endpoint" "dependants" {
      + data_factory_id    = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-runtimes-sbox/providers/Microsoft.DataFactory/factories/ingest00-runtimes-dataFactory001-sbox"
      + fqdns              = (known after apply)
      + id                 = (known after apply)
      + name               = "ingest00-runtimes-dataFactory001-purview_eventhub-sbox"
      + subresource_name   = "namespace"
      + target_resource_id = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest-mgmt-purview-sbox/providers/Microsoft.EventHub/namespaces/Atlas-9be4da85-1798-4608-bee0-5f5232885d13"
    }

  # module.data_landing_zone["00"].module.runtimes_datafactory.null_resource.private_endpoint_approvals["purview"] will be created
  + resource "null_resource" "private_endpoint_approvals" {
      + id = (known after apply)
    }

  # module.data_landing_zone["00"].module.runtimes_datafactory.null_resource.private_endpoint_approvals["purview-storage-blob"] will be created
  + resource "null_resource" "private_endpoint_approvals" {
      + id = (known after apply)
    }

  # module.data_landing_zone["00"].module.runtimes_datafactory.null_resource.private_endpoint_approvals["purview-storage-queue"] will be created
  + resource "null_resource" "private_endpoint_approvals" {
      + id = (known after apply)
    }

  # module.data_landing_zone["00"].module.runtimes_datafactory.null_resource.private_endpoint_approvals["purview_eventhub"] will be created
  + resource "null_resource" "private_endpoint_approvals" {
      + id = (known after apply)
    }

  # module.data_landing_zone["00"].module.shared_integration_datafactory.azurerm_data_factory_linked_service_azure_blob_storage.this["ingest00curatedsbox"] will be created
  + resource "azurerm_data_factory_linked_service_azure_blob_storage" "this" {
      + data_factory_id          = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-shared-integration-sbox/providers/Microsoft.DataFactory/factories/ingest00-integration-dataFactory001-sbox"
      + id                       = (known after apply)
      + integration_runtime_name = "AutoResolveIntegrationRuntime"
      + name                     = "ingest00curatedsbox"
      + service_endpoint         = (sensitive value)
      + use_managed_identity     = true
    }

  # module.data_landing_zone["00"].module.shared_integration_datafactory.azurerm_data_factory_linked_service_azure_blob_storage.this["ingest00rawsbox"] will be created
  + resource "azurerm_data_factory_linked_service_azure_blob_storage" "this" {
      + data_factory_id          = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-shared-integration-sbox/providers/Microsoft.DataFactory/factories/ingest00-integration-dataFactory001-sbox"
      + id                       = (known after apply)
      + integration_runtime_name = "AutoResolveIntegrationRuntime"
      + name                     = "ingest00rawsbox"
      + service_endpoint         = (sensitive value)
      + use_managed_identity     = true
    }

  # module.data_landing_zone["00"].module.shared_integration_datafactory.azurerm_data_factory_linked_service_azure_databricks.this["ingest00-integration-databricks001-sbox"] will be created
  + resource "azurerm_data_factory_linked_service_azure_databricks" "this" {
      + adb_domain                 = "https://adb-5739478046247291.11.azuredatabricks.net"
      + data_factory_id            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-shared-integration-sbox/providers/Microsoft.DataFactory/factories/ingest00-integration-dataFactory001-sbox"
      + id                         = (known after apply)
      + integration_runtime_name   = "AutoResolveIntegrationRuntime"
      + msi_work_space_resource_id = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-shared-integration-sbox/providers/Microsoft.Databricks/workspaces/ingest00-integration-databricks001-sbox"
      + name                       = "ingest00-integration-databricks001-sbox"

      + new_cluster_config {
          + cluster_version             = "7.3.x-scala2.12"
          + custom_tags                 = {
              + "application"  = "dlrm-data-ingest"
              + "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
              + "businessArea" = "cross-cutting"
              + "criticality"  = "Low"
              + "environment"  = "sandbox"
              + "expiresAfter" = "3000-01-01"
            }
          + driver_node_type            = "Standard_DS3_v2"
          + max_number_of_workers       = 15
          + min_number_of_workers       = 1
          + node_type                   = "Standard_DS3_v2"
          + spark_environment_variables = {
              + "PYSPARK_PYTHON" = "/databricks/python3/bin/python3"
            }
        }
    }

  # module.data_landing_zone["00"].module.shared_integration_datafactory.azurerm_data_factory_linked_service_azure_sql_database.this["ingest00-metadata-db-sbox"] will be created
  + resource "azurerm_data_factory_linked_service_azure_sql_database" "this" {
      + connection_string        = "Integrated Security=False;Encrypt=True;Connection Timeout=30;Data Source=ingest00-metadata-mssql-sbox.database.windows.net;Initial Catalog=ingest00-metadata-db-sbox"
      + data_factory_id          = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-shared-integration-sbox/providers/Microsoft.DataFactory/factories/ingest00-integration-dataFactory001-sbox"
      + id                       = (known after apply)
      + integration_runtime_name = "AutoResolveIntegrationRuntime"
      + name                     = "ingest00-metadata-db-sbox"
      + use_managed_identity     = true
    }

  # module.data_landing_zone["00"].module.shared_integration_datafactory.azurerm_data_factory_linked_service_key_vault.this["ingest00-meta001-sbox"] will be created
  + resource "azurerm_data_factory_linked_service_key_vault" "this" {
      + data_factory_id          = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-shared-integration-sbox/providers/Microsoft.DataFactory/factories/ingest00-integration-dataFactory001-sbox"
      + id                       = (known after apply)
      + integration_runtime_name = "AutoResolveIntegrationRuntime"
      + key_vault_id             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-metadata-sbox/providers/Microsoft.KeyVault/vaults/ingest00-meta001-sbox"
      + name                     = "ingest00-meta001-sbox"
    }

  # module.data_landing_zone["00"].module.shared_integration_datafactory.azurerm_data_factory_linked_service_sql_server.this["ingest00-metadata-mssql-sbox"] will be created
  + resource "azurerm_data_factory_linked_service_sql_server" "this" {
      + connection_string        = "Integrated Security=False;Encrypt=True;Connection Timeout=30;Data Source=ingest00-metadata-mssql-sbox.database.windows.net"
      + data_factory_id          = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-shared-integration-sbox/providers/Microsoft.DataFactory/factories/ingest00-integration-dataFactory001-sbox"
      + id                       = (known after apply)
      + integration_runtime_name = "AutoResolveIntegrationRuntime"
      + name                     = "ingest00-metadata-mssql-sbox"
    }

  # module.data_landing_zone["00"].module.shared_integration_datafactory.azurerm_data_factory_managed_private_endpoint.dependants["purview-storage-blob"] will be created
  + resource "azurerm_data_factory_managed_private_endpoint" "dependants" {
      + data_factory_id    = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-shared-integration-sbox/providers/Microsoft.DataFactory/factories/ingest00-integration-dataFactory001-sbox"
      + fqdns              = (known after apply)
      + id                 = (known after apply)
      + name               = "ingest00-integration-dataFactory001-purview-storage-blob-sbox"
      + subresource_name   = "blob"
      + target_resource_id = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest-mgmt-purview-sbox/providers/Microsoft.Storage/storageAccounts/scanuksouthojlgpfa"
    }

  # module.data_landing_zone["00"].module.shared_integration_datafactory.azurerm_data_factory_managed_private_endpoint.dependants["purview-storage-queue"] will be created
  + resource "azurerm_data_factory_managed_private_endpoint" "dependants" {
      + data_factory_id    = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-shared-integration-sbox/providers/Microsoft.DataFactory/factories/ingest00-integration-dataFactory001-sbox"
      + fqdns              = (known after apply)
      + id                 = (known after apply)
      + name               = "ingest00-integration-dataFactory001-purview-storage-queue-sbox"
      + subresource_name   = "queue"
      + target_resource_id = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest-mgmt-purview-sbox/providers/Microsoft.Storage/storageAccounts/scanuksouthojlgpfa"
    }

  # module.data_landing_zone["00"].module.shared_integration_datafactory.azurerm_data_factory_managed_private_endpoint.dependants["purview_eventhub"] will be created
  + resource "azurerm_data_factory_managed_private_endpoint" "dependants" {
      + data_factory_id    = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-shared-integration-sbox/providers/Microsoft.DataFactory/factories/ingest00-integration-dataFactory001-sbox"
      + fqdns              = (known after apply)
      + id                 = (known after apply)
      + name               = "ingest00-integration-dataFactory001-purview_eventhub-sbox"
      + subresource_name   = "namespace"
      + target_resource_id = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest-mgmt-purview-sbox/providers/Microsoft.EventHub/namespaces/Atlas-9be4da85-1798-4608-bee0-5f5232885d13"
    }

  # module.data_landing_zone["00"].module.shared_integration_datafactory.azurerm_data_factory_managed_private_endpoint.this["purview"] will be created
  + resource "azurerm_data_factory_managed_private_endpoint" "this" {
      + data_factory_id    = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-shared-integration-sbox/providers/Microsoft.DataFactory/factories/ingest00-integration-dataFactory001-sbox"
      + fqdns              = (known after apply)
      + id                 = (known after apply)
      + name               = "ingest00-integration-dataFactory001-purview-sbox"
      + subresource_name   = "account"
      + target_resource_id = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest-mgmt-rg-sbox/providers/Microsoft.Purview/accounts/ingest-mgmt-purview-sbox"
    }

  # module.data_landing_zone["00"].module.shared_integration_datafactory.azurerm_data_factory_managed_private_endpoint.this["storage-curated"] will be created
  + resource "azurerm_data_factory_managed_private_endpoint" "this" {
      + data_factory_id    = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-shared-integration-sbox/providers/Microsoft.DataFactory/factories/ingest00-integration-dataFactory001-sbox"
      + fqdns              = (known after apply)
      + id                 = (known after apply)
      + name               = "ingest00-integration-dataFactory001-storage-curated-sbox"
      + subresource_name   = "blob"
      + target_resource_id = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-storage-sbox/providers/Microsoft.Storage/storageAccounts/ingest00curatedsbox"
    }

  # module.data_landing_zone["00"].module.shared_integration_datafactory.azurerm_data_factory_managed_private_endpoint.this["storage-raw"] will be created
  + resource "azurerm_data_factory_managed_private_endpoint" "this" {
      + data_factory_id    = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-shared-integration-sbox/providers/Microsoft.DataFactory/factories/ingest00-integration-dataFactory001-sbox"
      + fqdns              = (known after apply)
      + id                 = (known after apply)
      + name               = "ingest00-integration-dataFactory001-storage-raw-sbox"
      + subresource_name   = "blob"
      + target_resource_id = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-storage-sbox/providers/Microsoft.Storage/storageAccounts/ingest00rawsbox"
    }

  # module.data_landing_zone["00"].module.shared_integration_datafactory.null_resource.private_endpoint_approvals["keyvault"] will be created
  + resource "null_resource" "private_endpoint_approvals" {
      + id = (known after apply)
    }

  # module.data_landing_zone["00"].module.shared_integration_datafactory.null_resource.private_endpoint_approvals["mssql"] will be created
  + resource "null_resource" "private_endpoint_approvals" {
      + id = (known after apply)
    }

  # module.data_landing_zone["00"].module.shared_integration_datafactory.null_resource.private_endpoint_approvals["purview"] will be created
  + resource "null_resource" "private_endpoint_approvals" {
      + id = (known after apply)
    }

  # module.data_landing_zone["00"].module.shared_integration_datafactory.null_resource.private_endpoint_approvals["purview-storage-blob"] will be created
  + resource "null_resource" "private_endpoint_approvals" {
      + id = (known after apply)
    }

  # module.data_landing_zone["00"].module.shared_integration_datafactory.null_resource.private_endpoint_approvals["purview-storage-queue"] will be created
  + resource "null_resource" "private_endpoint_approvals" {
      + id = (known after apply)
    }

  # module.data_landing_zone["00"].module.shared_integration_datafactory.null_resource.private_endpoint_approvals["purview_eventhub"] will be created
  + resource "null_resource" "private_endpoint_approvals" {
      + id = (known after apply)
    }

  # module.data_landing_zone["00"].module.shared_integration_datafactory.null_resource.private_endpoint_approvals["storage-curated"] will be created
  + resource "null_resource" "private_endpoint_approvals" {
      + id = (known after apply)
    }

  # module.data_landing_zone["00"].module.shared_integration_datafactory.null_resource.private_endpoint_approvals["storage-raw"] will be created
  + resource "null_resource" "private_endpoint_approvals" {
      + id = (known after apply)
    }

  # module.data_landing_zone["00"].module.synapse_pe["dev"].azurerm_private_endpoint.this must be replaced
-/+ resource "azurerm_private_endpoint" "this" {
      ~ custom_dns_configs       = [] -> (known after apply)
      ~ id                       = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-shared-product-sbox/providers/Microsoft.Network/privateEndpoints/ingest00-product-synapse001-dev-pe-sbox" -> (known after apply)
        name                     = "ingest00-product-synapse001-dev-pe-sbox"
      ~ network_interface        = [
          - {
              - id   = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-shared-product-sbox/providers/Microsoft.Network/networkInterfaces/ingest00-product-synapse001-dev-pe-sbox.nic.8f267232-5931-4a99-ace1-f254f9e3158a"
              - name = "ingest00-product-synapse001-dev-pe-sbox.nic.8f267232-5931-4a99-ace1-f254f9e3158a"
            },
        ] -> (known after apply)
      ~ private_dns_zone_configs = [
          - {
              - id                  = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-shared-product-sbox/providers/Microsoft.Network/privateEndpoints/ingest00-product-synapse001-dev-pe-sbox/privateDnsZoneGroups/endpoint-dnszonegroup/privateDnsZoneConfigs/privatelink.dev.azuresynapse.net"
              - name                = "privatelink.dev.azuresynapse.net"
              - private_dns_zone_id = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.dev.azuresynapse.net"
              - record_sets         = [
                  - {
                      - fqdn         = "ingest00-product-synapse001-sbox.privatelink.dev.azuresynapse.net"
                      - ip_addresses = [
                          - "10.247.3.25",
                        ]
                      - name         = "ingest00-product-synapse001-sbox"
                      - ttl          = 10
                      - type         = "A"
                    },
                ]
            },
        ] -> (known after apply)
        tags                     = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (3 unchanged attributes hidden)

      ~ private_dns_zone_group {
          ~ id                   = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-shared-product-sbox/providers/Microsoft.Network/privateEndpoints/ingest00-product-synapse001-dev-pe-sbox/privateDnsZoneGroups/endpoint-dnszonegroup" -> (known after apply)
            name                 = "endpoint-dnszonegroup"
            # (1 unchanged attribute hidden)
        }

      ~ private_service_connection {
            name                           = "ingest00-product-synapse001-sbox"
          ~ private_connection_resource_id = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-shared-product-sbox/providers/Microsoft.Synapse/workspaces/ingest00-product-synapse001-sbox" # forces replacement -> (known after apply) # forces replacement
          ~ private_ip_address             = "10.247.3.25" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # module.data_landing_zone["00"].module.synapse_pe["sql"].azurerm_private_endpoint.this must be replaced
-/+ resource "azurerm_private_endpoint" "this" {
      ~ custom_dns_configs       = [] -> (known after apply)
      ~ id                       = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-shared-product-sbox/providers/Microsoft.Network/privateEndpoints/ingest00-product-synapse001-sql-pe-sbox" -> (known after apply)
        name                     = "ingest00-product-synapse001-sql-pe-sbox"
      ~ network_interface        = [
          - {
              - id   = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-shared-product-sbox/providers/Microsoft.Network/networkInterfaces/ingest00-product-synapse001-sql-pe-sbox.nic.2a48b954-8a18-4db2-a16e-de6bda9ebfc5"
              - name = "ingest00-product-synapse001-sql-pe-sbox.nic.2a48b954-8a18-4db2-a16e-de6bda9ebfc5"
            },
        ] -> (known after apply)
      ~ private_dns_zone_configs = [
          - {
              - id                  = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-shared-product-sbox/providers/Microsoft.Network/privateEndpoints/ingest00-product-synapse001-sql-pe-sbox/privateDnsZoneGroups/endpoint-dnszonegroup/privateDnsZoneConfigs/privatelink.sql.azuresynapse.net"
              - name                = "privatelink.sql.azuresynapse.net"
              - private_dns_zone_id = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.sql.azuresynapse.net"
              - record_sets         = [
                  - {
                      - fqdn         = "ingest00-product-synapse001-sbox.privatelink.sql.azuresynapse.net"
                      - ip_addresses = [
                          - "10.247.3.24",
                        ]
                      - name         = "ingest00-product-synapse001-sbox"
                      - ttl          = 10
                      - type         = "A"
                    },
                ]
            },
        ] -> (known after apply)
        tags                     = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (3 unchanged attributes hidden)

      ~ private_dns_zone_group {
          ~ id                   = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-shared-product-sbox/providers/Microsoft.Network/privateEndpoints/ingest00-product-synapse001-sql-pe-sbox/privateDnsZoneGroups/endpoint-dnszonegroup" -> (known after apply)
            name                 = "endpoint-dnszonegroup"
            # (1 unchanged attribute hidden)
        }

      ~ private_service_connection {
            name                           = "ingest00-product-synapse001-sbox"
          ~ private_connection_resource_id = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-shared-product-sbox/providers/Microsoft.Synapse/workspaces/ingest00-product-synapse001-sbox" # forces replacement -> (known after apply) # forces replacement
          ~ private_ip_address             = "10.247.3.24" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # module.data_landing_zone["00"].module.synapse_pe["sqlOnDemand"].azurerm_private_endpoint.this must be replaced
-/+ resource "azurerm_private_endpoint" "this" {
      ~ custom_dns_configs       = [] -> (known after apply)
      ~ id                       = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-shared-product-sbox/providers/Microsoft.Network/privateEndpoints/ingest00-product-synapse001-sqlOnDemand-pe-sbox" -> (known after apply)
        name                     = "ingest00-product-synapse001-sqlOnDemand-pe-sbox"
      ~ network_interface        = [
          - {
              - id   = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-shared-product-sbox/providers/Microsoft.Network/networkInterfaces/ingest00-product-synapse001-sqlOnDemand-pe-.nic.ff435841-c12a-47f0-8cea-e34005b63c7e"
              - name = "ingest00-product-synapse001-sqlOnDemand-pe-.nic.ff435841-c12a-47f0-8cea-e34005b63c7e"
            },
        ] -> (known after apply)
      ~ private_dns_zone_configs = [
          - {
              - id                  = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-shared-product-sbox/providers/Microsoft.Network/privateEndpoints/ingest00-product-synapse001-sqlOnDemand-pe-sbox/privateDnsZoneGroups/endpoint-dnszonegroup/privateDnsZoneConfigs/privatelink.sql.azuresynapse.net"
              - name                = "privatelink.sql.azuresynapse.net"
              - private_dns_zone_id = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.sql.azuresynapse.net"
              - record_sets         = [
                  - {
                      - fqdn         = "ingest00-product-synapse001-sbox-ondemand.privatelink.sql.azuresynapse.net"
                      - ip_addresses = [
                          - "10.247.3.23",
                        ]
                      - name         = "ingest00-product-synapse001-sbox-ondemand"
                      - ttl          = 10
                      - type         = "A"
                    },
                ]
            },
        ] -> (known after apply)
        tags                     = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (3 unchanged attributes hidden)

      ~ private_dns_zone_group {
          ~ id                   = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-shared-product-sbox/providers/Microsoft.Network/privateEndpoints/ingest00-product-synapse001-sqlOnDemand-pe-sbox/privateDnsZoneGroups/endpoint-dnszonegroup" -> (known after apply)
            name                 = "endpoint-dnszonegroup"
            # (1 unchanged attribute hidden)
        }

      ~ private_service_connection {
            name                           = "ingest00-product-synapse001-sbox"
          ~ private_connection_resource_id = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-shared-product-sbox/providers/Microsoft.Synapse/workspaces/ingest00-product-synapse001-sbox" # forces replacement -> (known after apply) # forces replacement
          ~ private_ip_address             = "10.247.3.23" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

Plan: 31 to add, 6 to change, 4 to destroy.
```

</details>



<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.data_landing_zone["00"].module.shared_integration_datafactory.azurerm_data_factory.this has changed
  ~ resource "azurerm_data_factory" "this" {
        id                              = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-shared-integration-sbox/providers/Microsoft.DataFactory/factories/ingest00-integration-dataFactory001-sbox"
        name                            = "ingest00-integration-dataFactory001-sbox"
        tags                            = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (5 unchanged attributes hidden)

      ~ identity {
          + identity_ids = []
            # (3 unchanged attributes hidden)
        }
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","PRNumber":5,"Program":"tfcmt","SHA1":"","Target":"sbox_landing","Vars":{}} -->